Documents/СводныйДневнойОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СводныйДневнойОтчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РозничнаяВыручка</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗакупкаСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗакупкаПродСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратПродСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инкассация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаБонусами</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уценка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дооценка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Недостачи</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПродСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаниеРеализованнаяСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаниеРеализованнаяПродСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаниеОтклонениеОтОстаткаСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаниеОтклонениеОтОстаткаПродСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФактическиеОстатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактОстатокСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактОстатокПродСтоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьВал</Name>
					<Comment>Сумма в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыХраненияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоОтрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоОтрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаршрутРазвоза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыРазвоза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КаналСбыта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КД_КаналыСбыта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПродукта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КД_ГруппыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРознице</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтделМагазина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СводныйДневнойОтчет/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область КомандыФормы

&НаКлиенте
Процедура КомандаЗаполнить(команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьОстатки(команда)
	КомандаЗаполнитьОстаткиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
Процедура КомандаЗаполнитьНаСервере()

	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатков.ЦФО,
	|	ТаблицаОстатков.ФактОстатокСтоимость,
	|	ТаблицаОстатков.ФактОстатокПродСтоимость
	|ПОМЕСТИТЬ ВТ_ТаблицаОстатков
	|ИЗ
	|	&ТаблицаФактическихОстатков КАК ТаблицаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтделыВМагазинах.Ссылка КАК ОтделВМагазине,
	|	ОтделыВМагазинах.Магазин КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ОтделыВМагазинах
	|ИЗ
	|	Справочник.ОтделыВМагазинах КАК ОтделыВМагазинах
	|ГДЕ
	|	ОтделыВМагазинах.Подразделение = &Подразделение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСкладахОстатки.ЦФО КАК ЦФО,
	|	0 КАК Инкассация,
	|	СУММА(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток) КАК ОстатокСтоимость,
	|	СУММА(ПартииТоваровНаСкладахОстатки.ПродСтоимостьОстаток) КАК ОстатокПродСтоимость,
	|	0 КАК ОплатаБонусами,
	|	0 КАК Скидка,
	|	0 КАК ФактОстатокСтоимость,
	|	0 КАК ФактОстатокПродСтоимость,
	|	0 КАК МаржинальныйДоход
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|			&МоментВремени,
	|			Подразделение = &Подразделение
	|				И СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Внутренний.Топливо)) КАК ПартииТоваровНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладахОстатки.ЦФО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РозничнаяВыручкаОстатки.ЦФО,
	|	-РозничнаяВыручкаОстатки.СуммаОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.РозничнаяВыручка.Остатки(&МоментВремени, Подразделение = &Подразделение) КАК РозничнаяВыручкаОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Р_ПОСКассы.Ссылка.ОтделВМагазине,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(Р_ПродажиПоБонуснымКартам.СуммаБонусовСписано),
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.Р_ПродажиПоБонуснымКартам КАК Р_ПродажиПоБонуснымКартам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Р_ПОС.Кассы КАК Р_ПОСКассы
	|		ПО Р_ПродажиПоБонуснымКартам.ККР = Р_ПОСКассы.ККР
	|ГДЕ
	|	Р_ПродажиПоБонуснымКартам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Р_ПродажиПоБонуснымКартам.Подразделение = &Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Р_ПОСКассы.Ссылка.ОтделВМагазине
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Р_ПОСКассы.Ссылка.ОтделВМагазине,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА((ВЫРАЗИТЬ(ЧекККМТовары.Количество * ЧекККМТовары.Цена КАК ЧИСЛО(10, 2))) - ЧекККМТовары.Сумма),
	|	0,
	|	0,
	|	0
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Р_ПОС.Кассы КАК Р_ПОСКассы
	|		ПО ЧекККМТовары.Ссылка.Р_ПОС = Р_ПОСКассы.Ссылка
	|ГДЕ
	|	ЧекККМТовары.Ссылка.Проведен = ИСТИНА
	|	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЧекККМТовары.Ссылка.Подразделение = &Подразделение
	|	И ЧекККМТовары.ПроцентСкидкиНаценки <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Р_ПОСКассы.Ссылка.ОтделВМагазине
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОстатков.ЦФО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ТаблицаОстатков.ФактОстатокСтоимость,
	|	ВТ_ТаблицаОстатков.ФактОстатокПродСтоимость,
	|	0
	|ИЗ
	|	ВТ_ТаблицаОстатков КАК ВТ_ТаблицаОстатков
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПродажиОбороты.ЦФО,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ПродажиОбороты.ДоходОборот)
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &МоментВремени, , Подразделение = &Подразделение) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ЦФО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ЦФО,
	|	СУММА(ВТ_ИсходныеДанные.Инкассация) КАК Инкассация,
	|	СУММА(ВТ_ИсходныеДанные.ОстатокСтоимость) КАК ОстатокСтоимость,
	|	СУММА(ВТ_ИсходныеДанные.ОстатокПродСтоимость) КАК ОстатокПродСтоимость,
	|	СУММА(ВТ_ИсходныеДанные.ОплатаБонусами) КАК ОплатаБонусами,
	|	СУММА(ВТ_ИсходныеДанные.Скидка) КАК Скидка,
	|	СУММА(ВТ_ИсходныеДанные.ФактОстатокСтоимость) КАК ФактОстатокСтоимость,
	|	СУММА(ВТ_ИсходныеДанные.ФактОстатокПродСтоимость) КАК ФактОстатокПродСтоимость,
	|	СУММА(ВТ_ИсходныеДанные.МаржинальныйДоход) КАК Недостачи
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.ЦФО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИсходныеДанные.ЦФО.Наименование";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("Отправитель", Объект.Отправитель);
	запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Дата));
	запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Дата));
	запрос.УстановитьПараметр("МоментВремени", Новый Граница(Объект.Дата, ВидГраницы.Включая));
	запрос.УстановитьПараметр("ТаблицаФактическихОстатков", Объект.ФактическиеОстатки.Выгрузить());
	
	результатЗапроса = запрос.Выполнить();
	
	Если Не результатЗапроса.Пустой() Тогда
		Объект.Состав.Очистить();
	Иначе
		сообщениеПользователю = Новый СообщениеПользователю;
		сообщениеПользователю.Текст = "Отсутствуют данные для заполнения!";
		сообщениеПользователю.Сообщить();
	КонецЕсли;
	
	выборка = результатЗапроса.Выбрать();
	Пока выборка.Следующий() Цикл
		
		новаяСтрокаСостава = Объект.Состав.Добавить();
		
		ЗаполнитьЗначенияСвойств(новаяСтрокаСостава, выборка);
		
		инкассацияСтоимость = выборка.Инкассация + выборка.ОплатаБонусами - выборка.Недостачи;
		
		Если Не инкассацияСтоимость = 0 Тогда
			новаяСтрокаСостава.СписаниеРеализованнаяСтоимость = Макс(Мин(инкассацияСтоимость, выборка.ОстатокСтоимость), 0);
		КонецЕсли;
		
		Если Не выборка.ФактОстатокСтоимость = 0 Тогда
			новаяСтрокаСостава.СписаниеОтклонениеОтОстаткаСтоимость = (новаяСтрокаСостава.ОстатокСтоимость - новаяСтрокаСостава.СписаниеРеализованнаяСтоимость) - выборка.ФактОстатокСтоимость;
		КонецЕсли;
		
		Если Не выборка.ФактОстатокПродСтоимость = 0 Тогда
			новаяСтрокаСостава.СписаниеОтклонениеОтОстаткаПродСтоимость = новаяСтрокаСостава.ОстатокПродСтоимость - выборка.ФактОстатокПродСтоимость;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьОстаткиНаСервере()

	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВРозницеОстатки.ОтделМагазина КАК ЦФО,
	|	СУММА(ТоварыВРозницеОстатки.СуммаОстаток) КАК ФактОстатокСтоимость,
	|	СУММА(ТоварыВРозницеОстатки.СуммаОстаток + ТоварыВРозницеОстатки.НаценкаОстаток) КАК ФактОстатокПродСтоимость
	|ИЗ
	|	РегистрНакопления.ТоварыВРознице.Остатки(&КонецПериода, Подразделение = &Подразделение) КАК ТоварыВРозницеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРозницеОстатки.ОтделМагазина
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыВРозницеОстатки.ОтделМагазина.Наименование";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	запрос.УстановитьПараметр("КонецПериода", Новый Граница(Объект.Дата, ВидГраницы.Включая));
	
	результатЗапроса = запрос.Выполнить();
	
	Объект.ФактическиеОстатки.Загрузить(результатЗапроса.Выгрузить());

КонецПроцедуры

#КонецОбласти
